app/Controllers/Admin/UserController.php

    public function getData(){
        if($this->request->isAJAX()){
            $data=[
                'user'=>$this->usermodel->findAll()
            ] ;
---
SELECT *
FROM `users`