app/Controllers/Admin/UserController.php

SELECT *
FROM `users`
---
    public function index()
    {
        $data = [
            'menu' => 'halUser',
            'user' => $this->usermodel->findAll()

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function detail($id)
    {
        $data = [
            'menu' => 'halUser',
            'user' => $this->usermodel->find($id)

INSERT INTO `users` (`nama`, `tempat_lahir`, `tanggal_lahir`, `alamat`, `telepon`, `email`, `avatar`, `created_at`, `updated_at`) VALUES ('432 12312', '', '', '', '', '', 'default.jpg', '2023-10-28 09:44:30', '2023-10-28 09:44:30')
---
            'avatar' => $namaavatar
        ];

        $this->usermodel->save($data);

SELECT *
FROM `users`
---
    public function getData(){
        if($this->request->isAJAX()){
            $data=[
                'user'=>$this->usermodel->findAll()
            ] ;